src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getMsofficeRequest>
         <gs:name>Office 365 For Personal use</gs:name>
      </gs:getMsofficeRequest>
   </soapenv:Body>
</soapenv:Envelope>